[
    {
        "Name": "Accounting Society",
        "Description": " The Accounting Society strives to educate its members about current accounting and business issues, while simultaneously helping its members learn the hard and soft skills required to become successful business professionals and community leaders in today’s competitive business environment.",
        "Contact": "accountingsocietyhc@gmail.com"
    },
    {
        "Name": "Association of Business Students",
        "Description": "ABS serves as an informational and developmental forum for students interested in learning more about the interdisciplinary fields of business. ABS strives to unite members of diverse scholastic backgrounds and expose them to various business career-paths available to any majors.",
        "Contact": "absofhuntercollege@gmail.com"
    },
    {
        "Name": "Bachelor of Fine Arts Student Organization",
        "Description": "To engage in outreach and to create workshops helping students understand the role of a BFA degree. ",
        "Contact": "hunterbfaso@gmail.com"
    },
    {
        "Name": "Computer Science Club",
        "Description": "We aim to provide a general and inclusive space for interested students in all fields of Computer Science while providing them with the skills necessary to pursue a related career through the form of weekly meetings, practical projects, workshops, and guides.",
        "Contact": "huntercsclub@gmail.com"
    },
    {
        "Name": "CUNY Edge Club of Hunter College",
        "Description": "The CUNY EDGE Club aims to develop strong leadership skills amongst its members. Students from diverse backgrounds will come together from an array of majors to network, encouraging each other to become more diverse thinkers – all while preparing them for real-life scenarios and supporting their professional development. The club will give a new meaning to living life on the edge!",
        "Contact": "cunyedgehtr@gmail.com"
    },
    {
        "Name": "Girls Who Code College Loops",
        "Description": "Support women on their journey in computing during their college year, introduce programming to students who may not be in the CS major, and foster an inclusive environment that encourages women to pursue computer science.",
        "Contact": "girlswhocodehuntercollege@gmail.com"
    },
    {
        "Name": "Latino Medical Student Association",
        "Description": "The purpose of this club is to help increase access to resources, enrichment opportunities, counseling and mentorship to Latino pre-med students. ",
        "Contact": "lmsaclub1@gmail.com"
    },
    {
        "Name": "Medical History Society",
        "Description": "The Medical History Society is a space where students will be able to delve into the rich history of medicine, to learn about the evolution of medical practices, treatments, and technologies over time.",
        "Contact": "medicalhistorysociety2023@example.com"
    },
    {
        "Name": "Medical Laboratory Science Club",
        "Description": "The Medical Laboratory Science Club is dedicated to learning and developing professionalism while providing gateways to become better scientists.",
        "Contact": "mlsclubhunter@gmail.com"
    },
    {
        "Name": "National Student Nurses Association",
        "Description": "The purpose of the Hunter-Bellevue Student Nurses Association (HBSNA) is to provide activities and functions that contribute to the fundamental and professional development of future nurses.",
        "Contact": "president.hbsna@gmail.com"
    },
    {
        "Name": "Pre-Dental Society of Hunter College",
        "Description": "The purpose of the Pre-Dental Society is to provide opportunities and guidance for pre-dental students at Hunter College. We organize events to foster the growth of pre-dental students at Hunter College. Additionally, we provide opportunities for students that are critical for the dental school application process.",
        "Contact": "pds.hunter@gmail.com"
    },
    {
        "Name": "Pre-Health Organization",
        "Description": "The purpose of this club is to provide pre-health students of all various academic backgrounds with information and skills necessary to make them strong applicants for pre-health graduate schools, to be the conduit between the pre-health students, pre-health advisors, and the admin of various health professional schools, and to build a network and team of students that will build and sustain their community through various acts of connection and community service.",
        "Contact": "hunterprehealth@gmail.com"
    },
    {
        "Name": "Pre-Health Research Initiative",
        "Description": "The purpose of this club is to enrich the academic and professional development of undergraduate students by equipping them with knowledge, skills, and experiences that will produce competitive candidates for professional health-related programs, who are better prepared to become successful participants in various health and graduate professions.",
        "Contact": "ph.researchinitiative@gmail.com"
    },
    {
        "Name": "Pre-Law Society",
        "Description": "The Pre-Law Society fosters an extracurricular environment for students on the pre-law track or interested in learning about law school. It also supports Hunter College’s Pre-Law Office and its director with event coordination, promotion, and execution. We are responsible for coordinating the annual law school trip and have meetings every week.",
        "Contact": "PLSHunter@gmail.com"
    },
    {
        "Name": "Pre-Optometry Society",
        "Description": "The purpose of this organization is to enrich the academic and professional development of Hunter College students who are interested in the field of optometry.",
        "Contact": "hunterpreoptometry@gmail.com"
    },
    {
        "Name": "Pre-PA Society of Hunter College",
        "Description": "Our mission is to provide the pre-PA students of Hunter College a community where they can engage with their fellow pre-PA peers, while giving them the knowledge and opportunities that will better prepare them for the pre-PA path. We aim to prepare students for the application process, guide them through meaningful workshops, and allow them to explore different aspects of the PA career.",
        "Contact": "prepasocietyofhuntercollege@gmail.com"
    },
    {
        "Name": "Pre-Veterinary Club",
        "Description": "The purpose of the club is to provide support to students who are looking or are taking the steps in applying to veterinary school. We are a club that would provide the steps in applying, building a strong application and to aid them in any questions they need. We would provide group activities that would aid them in their application process.",
        "Contact": "hunterprevet@gmail.com"
    },
    {
        "Name": "Psychology Club",
        "Description": "The purpose of the Psychology Club is to facilitate a cohesive social group aimed at providing students with an opportunity to gain a greater appreciation for the discipline of psychology, and to facilitate the dissemination of relevant information for matters of concern to members.",
        "Contact": "psychnewshunter@gmail.com"
    },
    {
        "Name": "Urban Public Health",
        "Description": "To represent the academic and professional goals of students enrolled in the undergraduate Public Health (PH) program or Nutrition and Food Science (NFS) program by bringing awareness of urban public health issues and resources to the Hunter College community. ",
        "Contact": "hunteruphclub@gmail.com"
    },
    {
        "Name": "Latino Medical Student Association",
        "Description": "The purpose of this club is to help increase access to resources, enrichment opportunities, counseling and mentorship to Latino pre-med students. ",
        "Contact": "lmsaclub1@gmail.com"
    },
    {
        "Name": "American Cancer Society",
        "Description": "American Cancer Society is dedicated to helping people who face cancer. Our purpose is to provide support, encourage prevention, promote a healthy lifestyle, foster innovation, discuss cancer disparities, and share stories of researchers and cancer survivors. ",
        "Contact": "acshuntercollege@gmail.com"
    },
    {
        "Name": "Asian Pacific American Medical Student Association of Hunter College",
        "Description": "The Asian Pacific American Medical Student Association of Hunter College is a community of Hunter College student leaders dedicated to exploring and addressing the unique health challenges of Asian and Pacific Islander American communities to improve their overall well-being.",
        "Contact": "apamsaxhunter@gmail.com"
    },
    {
        "Name": "Best Buddies",
        "Description": "Best Buddies at Hunter College is a part of Best Buddies International, a nonprofit that creates opportunities for friendships between people with and without intellectual and developmental disabilities (IDD).",
        "Contact": "bestbuddieshunter@gmail.com"
    },
    {
        "Name": "Catholic Medical Mission Board",
        "Description": "The CMMB x Hunter Club partners with CMMB, a global health nonprofit organization, to advocate and bring attention to the lack of proper healthcare women and children face in the developing world.",
        "Contact": "cmmbxhunter@gmail.com"
    },
    {
        "Name": "Coalition for the Revitalization of Asian American Studies of Hunter College",
        "Description": "The club's purpose is to create a safe space for Hunter students who may identify as Asian American to share their experiences and learn about Asian American history and inform students of current courses, faculty, and resources Hunter has to offer.",
        "Contact": "craash131@gmail.com"
    },
    {
        "Name": "Doctors without Borders",
        "Description": "The purpose of this student chapter is to spread knowledge and raise awareness regarding MSF’s work in the field and about humanitarian issues. We expect to involve our fellow students in non-governmental organizations such as MSF through advocacy campaigns.",
        "Contact": "fomsf.hunter@gmail.com"
    },
    {
        "Name": "DREAM Team",
        "Description": "The purpose of the club is to create a space for people who are/or support undocumented students and their families, and provide them with information and resources as well as emotional support. The club will give undocumented students a place to come out and feel free within their own school.",
        "Contact": "hunterdreamteam@gmail.com"
    },
    {
        "Name": "Empowering Women in STEM",
        "Description": "The club's purpose is to cultivate a community that makes women feel more confident in their STEM career pursuits. We will practice things like public speaking, leadership skills, as well as provide networking opportunities and how to manage stress due to being in the STEM field.",
        "Contact": "hunterwomeninstem@gmail.com"
    },
    {
        "Name": "Greenbelt Society of Hunter College",
        "Description": "Our mission is to provide a platform for members to actively participate in projects, events and other activities in environmental science and sustainable development. We seek to promote intellectual and professional development through discussion, interdisciplinary collaboration and external networks.",
        "Contact": "greenbeltsociety1@gmail.com"
    },
    {
        "Name": "Hear Your Song",
        "Description": "Hear Your Song volunteers work with children and teens to guide them through the process of writing their own song lyrics. Using the kid songwriter’s ideas for musical style, melody, instrumentation, and tempo, volunteer composers and musicians then set those words to music and record the song to be heard, celebrated, and shared.",
        "Contact": "huntercollege@hearyoursong.org"
    },
    {
        "Name": "Heart at Hunter",
        "Description": "Heart at Hunter aims to help provide interested students with knowledge of key cardiovascular and heart issues.",
        "Contact": "aha.huntercollege@gmail.com"
    },
    {
        "Name": "Internationalist Club",
        "Description": "To discuss the issues of civil rights and liberties, immigrant rights, gay rights and Marxist sociological theory.",
        "Contact": "cunyinternationalists@gmail.com"
    },
    {
        "Name": "Music is Medicine",
        "Description": "The purpose of Music is Medicine is for Hunter College student musicians to provide musical performances for patients in the hospital. ",
        "Contact": "musicismedicine.club@gmail.com"
    },
    {
        "Name": "National Alliance on Mental Illness",
        "Description": "Our goal is to raise mental health awareness on campus, reduce the stigma of mental illness, and encourage a healthy discussion on various mental health topics.",
        "Contact": "namioncampushunter@gmail.com"
    },
    {
        "Name": "Palestine Solidarity Alliance of Hunter College",
        "Description": "The Palestine Solidarity Alliance intends to strengthen alliance between the Palestinian people and minorities here within the United States, highlighting the intersectionality of their struggles. ",
        "Contact": "psa.huntercollege@gmail.com"
    },
    {
        "Name": "Pre-Health for Human Rights Society at Hunter",
        "Description": "Our purpose is to work at the intersection of medicine, science, and law to secure human rights and justice for all.",
        "Contact": "phhrhunter@gmail.com"
    },
    {
        "Name": "Project HOPE Chapter at Hunter",
        "Description": "The purpose of this club is to serve as a chapter of Project HOPE, a charitable organization that partners with communities, healthcare systems, and physicians to heal people and save lives, while empowering healthcare workers to create a healthier, more equitable world.",
        "Contact": "projecthope.hunter@gmail.com"
    },
    {
        "Name": "Queer Student Union",
        "Description": "To ensure a safe environment for Lesbian, Gay, Bisexual, Trans, Intersex, Asexual, Queer, Pansexual, and others (recognizing that our community is always growing – referred to herein as “LGBTQ+”) persons of all backgrounds and their allies by establishing a space free of sexism, racism, homophobia, transphobia, ableism and religionism.",
        "Contact": "queerstudentunionHC@gmail.com"
    },
    {
        "Name": "Sexual Wellness Society of Hunter College",
        "Description": "The purpose of this association is to initiate discussions of sexual wellness and how it concerns students of Hunter college.",
        "Contact": ""
    },
    {
        "Name": "Sign4ERA Club at Hunter",
        "Description": "To mobilize individuals at Hunter College to join our petition drive and voice their support for the ratification of the Equal Rights Amendment. ",
        "Contact": "sign4erahunter@gmail.com"
    },
    {
        "Name": "Student Veteran’s Club of Hunter College",
        "Description": "The Club is a non-political, non-profit organization that brings people together through our shared respect, and desire to learn about and help our nation’s heroes; many of whom are our friends and classmates.",
        "Contact": "huntervetclub@gmail.com"
    },
    {
        "Name": "United for Youth",
        "Description": "United for Youth is dedicated to improving the lives of children and teens currently in foster care. Our purpose is to advocate for them by spreading awareness of the obstacles they go through, helping them feel confident and secure, and providing them the needs for their success.",
        "Contact": "unitedforyouth.hc@gmail.com"
    },
    {
        "Name": "African Student Union",
        "Description": "The purpose of African Student Union is to represent and spread the rich culture and history of the African Continent to the Hunter College Community, as well as come together as a diverse group of people to uphold the values we share.",
        "Contact": "asuhuntercollege@gmail.com"
    },
    {
        "Name": "Artemis Hellenic Club",
        "Description": "The purpose of this club is to learn about and celebrate Hellenic culture through the food, history, art, music, and dance of Greece.",
        "Contact": "artemichellenic.hc@gmail.com"
    },
    {
        "Name": "Asian Student Union",
        "Description": "The purpose of the Asian Student Union is to provide an inclusive space for promoting Asian cultures by exploring the Asian American identity, celebrating the achievements of Asians in America, and addressing harmful stereotypes. We will endorse our space to advance collaboration and unity among all Asian clubs. ",
        "Contact": "huntercollegeasu1@gmail.com"
    },
    {
        "Name": "Bengali Student Association of Hunter College",
        "Description": "The Bengali Student Association (BSA) aims to promote and celebrate the diverse cultures, traditions, and academic achievements of Bengali and South Asian students at Hunter College. ",
        "Contact": "hunterbsa71@gmail.com"
    },
    {
        "Name": "Black Student Union",
        "Description": "Our mission is to be actively involved in the education and stimulation of the black student body.",
        "Contact": "bsu.huntercollege@gmail.com"
    },
    {
        "Name": "Japanese Club",
        "Description": "The purpose of the Japanese Club is to foster interest in Japanese culture for students who would like to learn more about it, regardless if they have taken language or culture courses at the college level or not.",
        "Contact": "japaneseclubofhunter@gmail.com"
    },
    {
        "Name": "Korean Student Association",
        "Description": "The mission of the Korean Students Association of Hunter College, a non-profit student run organization, shall be to promote Korean culture through cultural, social, political, and community service events. ",
        "Contact": ""
    },    
    {
        "Name": "Latinos of the Caribbean of Hunter College",
        "Description": "To build a safe environment to educate, celebrate, and experience the culture stemming from the different countries in Latin America and the Caribbean.",
        "Contact": "huntercollegelocs@gmail.com"
    },
    {
        "Name": "Mexican Student Union",
        "Description": "Our goal is to create a social and educational club in which everyone can share and celebrate the beauty of Mexico with our community here at Hunter. ",
        "Contact": "mexsuathunter@gmail.com"
    },
    {
        "Name": "Pakistani Student Organization",
        "Description": "The purpose of this club is to bring a community of Pakistani students together and create a safe space for them to connect. ",
        "Contact": "pakistanistudentalliance.hunter@gmail.com"
    },
    {
        "Name": "Pilipinos of Hunter",
        "Description": "Pilipinos of Hunter is committed to establish an inclusive community that celebrates Filipino culture, history and values.",
        "Contact": "hunterpoh@gmail.com"
    },
    {
        "Name": "Shikari Dance Team",
        "Description": "The purpose of the Shikari Dance Team at Hunter College is to promote cultural diversity and awareness through the different styles of South Asian dance.",
        "Contact": "shikaridance@gmail.com"
    },
    {
        "Name": "South Asian Cultural Club",
        "Description": "The South Asian Cultural Club (SACC) looks to provide a space for the undergraduate students at Hunter where they can appreciate and express the South Asian Culture. ",
        "Contact": "sacchunter68@gmail.com"
    },
    {
        "Name": "Southwest Asian and North African Women Association",
        "Description": "The South West Asian and North African Women Association is an effort to build a community within Hunter that supports and recognizes the achievements of women from the SWANA region. It will also allow for the education and appreciation of the unique yet intertwined cultures and history of the region.",
        "Contact": "swanahunter@gmail.com"
    },    
    {
        "Name": "Ukrainian Club of Hunter",
        "Description": "Ukrainian Club of Hunter is a club for students to bring the college community together to learn about Ukrainian culture, history and connect students who have interest in the culture.",
        "Contact": "ukrainianclubofhunter@gmail.com"
    },
    {
        "Name": "Uzbek Hawks of Hunter College",
        "Description": "Uzbek Hawks is dedicated to creating a community for Uzbek individuals to collaborate, network and get to know one another.",
        "Contact": "uzbekhawkshunter@gmail.com"
    },
    {
        "Name": "Vietnamese Student Association",
        "Description": "Vietnamese Student Association (VSA) at Hunter College serves to unite anyone with an affinity for and to promote Vietnamese culture and generate a community at Hunter College. ",
        "Contact": "huntercollegevsa@gmail.com"
    },
    {
        "Name": "Catholic John Henry Newman Club",
        "Description": "The CSA is a Catholic ministry whose primary mission is to serve the Hunter College, City University of New York community. We are called by Christ to build a faith community. Empowered by the Holy Spirit to be truly compassionate disciples, we are committed to the truth of the Gospel.",
        "Contact": "csa.hunter.cuny@gmail.com"
    },
    {
        "Name": "Hillel",
        "Description": "The goal of Hillel is to provide activities and a sense of community for all Jewish students on campus, with activities such as community service, educational programs about Judaism and Israel, and social events.",
        "Contact": "eboardhunterhillel@hunterhillel.org"
    },
    {
        "Name": "Hindu Students Association",
        "Description": "The goal of the Hindu Students Association is to create a space where people can learn about Hinduism through meetings and events.",
        "Contact": "namastehsa@gmail.com"
    },
    {
        "Name": "InterVarsity Christian Fellowship",
        "Description": "The purpose of InterVarsity Christian Fellowship is to establish and advance at colleges and universities witnessing communities of students and faculty who follow Jesus as Savior and Lord: growing in love for God, God’s Word, God’s people of every ethnicity and culture, and God’s purposes in the world.",
        "Contact": "hunterivcf7@gmail.com"
    },
    {
        "Name": "Muslim Student Association",
        "Description": "The purpose of the Muslim Student Association shall be to provide an organization where Muslims can assemble for prayer, community, and information about Islam. We shall also provide information to other Hunter College students about Islam and Muslims, and work towards dispelling any and all misconceptions about them in the community.",
        "Contact": "msahunter@gmail.com"
    },
    {
        "Name": "Reformed University Fellowship",
        "Description": "To provide Christian fellowship for our brothers and sisters in Christ at Hunter, to reach students at Hunter for Christ, to love and to serve Hunter College through our Christian witness, and preach Jesus Christ as the Risen Redeemer of Creation (Matthew 28:16-20). 2.",
        "Contact": "RUFGotham.hunter@gmail.com"
    },
    {
        "Name": "Sikh Student Association",
        "Description": "The purpose of the Sikh Student Association is to raise awareness and grow appreciation for the religion of Sikhism among the Hunter College community.",
        "Contact": "huntercollegessa@gmail.com"
    },
    {
        "Name": "SOON Movement",
        "Description": "To share awareness on the life of Jesus Christ and to grow together in fellowship as brothers and sisters in Christ.",
        "Contact": "huntersoonmovement@gmail.com"
    },
    {
        "Name": "Dance NOW",
        "Description": "The Dance Now Club was formed in Fall 2013 as the umbrella organization for ALL of the pre-existing dance clubs. The purpose of Dance Now is to bring the dance interests of the individual clubs mentioned above together as a collective organization.",
        "Contact": ""
    },
    {
        "Name": "Gen K K-Pop Dance Cover Team at Hunter College",
        "Description": "Gen-K is a K-Pop Dance Cover Team at Hunter College that establishes a community for individuals with a passion for K-Pop choreography. ",
        "Contact": "hunterdance@gmail.com"
    },
    {
        "Name": "Hawkapella Club",
        "Description": "The purpose of our club is to rehearse weekly and perform various contemporary music using only our voices to promote creativity and spread positive messages.",
        "Contact": "hawkapella@gmail.com"
    },
    {
        "Name": "Intonation",
        "Description": "The Intonation Club was formed in Fall 2013 as the umbrella organization for ALL of the pre-existing music clubs. The purpose of Intonation is to bring the musical interests of the individual dubs mentioned above together as a collective organization.",
        "Contact": "intonationclub@gmail.com"
    },
    {
        "Name": "Social and Ballroom Dance Club",
        "Description": "The Social and Ballroom Dance Club was founded with the goal of fostering a fun and social environment around partnered dance styles as well as representing Hunter College in collegiate Latin and Ballroom dance competitions. Our club welcomes dancers of all levels and backgrounds, including those interested in learning how to dance and experienced dancers.",
        "Contact": "ballroomathunter@gmail.com"
    },    
    {
        "Name": "Theatre Company",
        "Description": "Hunter Theatre Company provides students with the opportunity to explore and gain experience in the performing arts through workshops, seminars, events, and student lead productions.",
        "Contact": "htheatreco@gmail.com"
    },
    {
        "Name": "Virsa Bhangra Club",
        "Description": "The purpose of the Virsa Bhangra (dance) Club, is to allow students with a Punjabi background to reconnect with their culture and also provide opportunity for all the students at Hunter College to explore and appreciate Punjabi culture and traditions through dance.",
        "Contact": "virsabhangraclub@gmail.com"
    },
    {
        "Name": "American Red Cross",
        "Description": "The American Red Cross in Greater New York is a nonprofit humanitarian organization, led by volunteers, that provides relief to individuals affected by disasters, and help people prevent, prepare for, and respond to emergencies. ",
        "Contact": "redcrosshuntercollege@gmail.com"
    },
    {
        "Name": "Be the Match",
        "Description": "The purpose of Be The Match is to spread awareness of the severity of Blood Cancers and Disorders in our world today. Our goal is to gather as many volunteers as possible (of all race and ethnicities) to join the registry.",
        "Contact": "bethematch.hunter@gmail.com"
    },
    {
        "Name": "Project Sunshine",
        "Description": "Project Sunshine empowers a dynamic and dedicated corps of over 15,000 volunteers to bring programming – recreational (arts), educational (tutoring and mentoring) and social service (HIV and nutritional counseling) – to over 100,000 children facing medical challenges and their families in 100 major cities across the United States and in five international satellite sites: Canada, China, Israel, Kenya and Puerto Rico.",
        "Contact": "project.sunshine.hunter@gmail.com"
    },
    {
        "Name": "Anime and Manga Appreciation Club",
        "Description": "Our purpose is to connect a growing community of anime, manga and Japanese culture enthusiasts.",
        "Contact": "animeathunter@gmail.com"
    },
    {
        "Name": "Art for Healing Club of Hunter College",
        "Description": "Our club’s purpose is to showcase the benefits of art both for mental health and for career’s sake. ",
        "Contact": "art4healingclub@gmail.com"
    },
    {
        "Name": "Book Club",
        "Description": "The Book Club of Hunter College is a club for students to bring the college community together to learn about and discuss the selected books of the month. ",
        "Contact": "bookclubofhuntercollege@gmail.com"
    },
    {
        "Name": "Chai Coffee Lit at Hunter",
        "Description": "Chai Coffee Lit is a community safe space for BIPOC LGBTQ students which functions as bookclub; and is aimed at investigating texts at the intersection of Queer theory and Feminism by people of Color.",
        "Contact": "chaicoffeelit@gmail.com"
    },
    {
        "Name": "Chess Club",
        "Description": "We provide an environment in which people can play and conversate, where you can relax, play, and discuss chess.",
        "Contact": ""
    },
    {
        "Name": "Crochet and Knitting Club",
        "Description": "The aim of the club is to build a friendly community in which to foster a comfortable, productive, therapeutic, interactive, social working environment for members to experience, craft, appreciate, practice, and engage in fiber arts. .",
        "Contact": "crochetandknittingclub.hunter@gmail.com"
    },
    {
        "Name": "Healing Blessings",
        "Description": "The mission of Healing Blessings is to elevate the quality of life for individuals with neurodegenerative diseases like MS, Alzheimer's, and Parkinson's.",
        "Contact": "healingblessingshunter@gmail.com"
    },
    {
        "Name": "Healthcare Business Club",
        "Description": "Healthcare Business Club of Hunter College is a secular, student-operated volunteer organization whose mission is to promote the image of Hunter College as an institution that produces leaders who have an impact on the business of health care. ",
        "Contact": "thehealthcarebusinessclub@gmail.com"
    },
    {
        "Name": "Investment and Trading Society",
        "Description": "Investment & Trading Society aims to cultivate connections among Hunter College students who are interested in learning about the fundamentals of investing.",
        "Contact": "hunterit.society@gmail.com"
    },
    {
        "Name": "Knitted Knockers at Hunter College",
        "Description": "The club's purpose is to partner with Knitted Knockers Support Foundation, and members will volunteer to knit/crochet breast prosthetics for breast cancer survivors.",
        "Contact": "hunterknittedknockers@gmail.com"
    },
    {
        "Name": "Mission Nutrition",
        "Description": "The club's purpose is to educate students about what it means to eat healthy/ create healthy eating habits, sharing recipes, fitness advice, exploring community health, food insecurity, tackling nutrition myths and hard topics like food gentrification and eating disorders through information sessions and guest speakers.",
        "Contact": "missionnutritionhc@gmail.com"
    },
    {
        "Name": "Mother Nature’s Gift Chapter of Hunter College",
        "Description": "We are an organization dedicated to eliminating the stigmatization of periods by supplying students with the support and supplies they deserve. ",
        "Contact": "mnaturesgift.hunter@gmail.com"
    },
    {
        "Name": "Poetry of the East Club at Hunter College (PotE)",
        "Description": "Our focus will be the study, recitation, and historical examination of South Asian and Persian poetry.",
        "Contact": "poetryoftheeast.ofhunter@gmail.com"
    },
    {
        "Name": "Society of Bioethics and Medicine",
        "Description": "The purpose of this club is to bring awareness about ethical issues in medicine. ",
        "Contact": "bioethicsandmedicine@gmail.com"
    },
    {
        "Name": "Student Athlete Advisory Committee",
        "Description": "Act as a liaison between the administration and student-athletes, thereby providing student-athletes with a voice in the Athletic Department decision-making process.",
        "Contact": ""
    },
    {
        "Name": "Young Democratic Socialist at Hunter College",
        "Description": "We are the Hunter College chapter of the Young Democratic Socialists of America. Our goal is to organize for Democratic Socialism on the campus of Hunter College. ",
        "Contact": "youngdemsocsnyc@gmail.com"
    }

]
